import CarpenterCareerCard from "./ui/carpenter-career-card";
const vacancyData = [
  {
    candidateRequirements: {
      title: "Наш кандидат:",
      items: [
        "активний, чесний та відповідальний;",
        "вміє читати креслення та робити заміри;",
        "бажано без шкідливих звичок.",
      ],
    },
    responsibilities: {
      title: "Обов’язки:",
      items: [
        "працювати на деревообробних верстатах;",
        "збірка корпусних меблів, а також їх встановлення на об'єкті;",
        "підтримання механізмів та устаткування в належному стані.",
      ],
    },
    benefits: {
      title: "Що ми пропонуємо:",
      items: [
        "графік роботи: 5/2, з 08:30—17:30;",
        "офіційне працевлаштування;",
        "доброзичливу атмосферу у колективі.",
      ],
    },
    contactInfo: {
      message:
        "Якщо Вас зацікавила наша вакансія і Ви хочете стати частиною нашої команди — телефонуйте!",
      phone: "+38(068) 459 13 11",
    },
  },
  {
    candidateRequirements: {
      title: "Наш кандидат:",
      items: [
        "цілеспрямований, комунікабельний та відповідальний;",
        "знання Компас, SketchUp або аналогічних програм;",
        "знання сучасних тенденцій та матеріалів у меблевій індустрії.",
      ],
    },
    responsibilities: {
      title: "Обов’язки:",
      items: [
        "створення технічних креслень, схем та специфікацій для виробництва;",
        "розробка дизайн-проектів меблів з урахуванням індивідуальних потреб клієнта;",
        "вибір матеріалів та компонентів для виготовлення меблів.",
      ],
    },
    benefits: {
      title: "Що ми пропонуємо:",
      items: [
        "графік роботи: 5/2, з 08:30—17:30;",
        "офіційне працевлаштування;",
        "можливість кар'єрного зростання.",
      ],
    },
    contactInfo: {
      message: "Залишайте заявку на співбесіду або телефонуйте!",
      phone: "+38(099) 123 45 67",
    },
  },
];
export const careerList = [
  {
    id: 1,
    title: "Столяр",
    location: "Кіровоградська область, м. Олександрія ",
    content: <CarpenterCareerCard vacancy={vacancyData[0]} />,
    isRemote: false,
    jobType: "full-time",
    subtitle:
      "Наша команда професіоналів запрошує до себе столяра меблевого виробництва.",
  },
  {
    id: 2,
    title: "Конструктор меблів",
    location: "Кіровоградська область, м. Олександрія ",
    content: <CarpenterCareerCard vacancy={vacancyData[1]} />,
    isRemote: false,
    jobType: "full-time",
    subtitle:
      "Наша команда професіоналів запрошує до себе конструктора меблів.",
  },
];
